const { updateBuilder } = require('./expander-utils');

const extraProfessions = [
  // A
  "აგრონომი", "ადვოკატი", "აკადემიკოსი", "აკრობატი", "ალპინისტი", "ანალიტიკოსი", 
  "ანესთეზიოლოგი", "ანიმატორი", "ანთროპოლოგი", "არქეოლოგი", "არქიტექტორი", "არტისტი", 
  "ასისტენტი", "ასტრონავტი", "ასტრონომი", "ასტროფიზიკოსი", "აუდიტორი", "აფთიაქარი", 
  "ავტომექანიკოსი", "აგენტი", "ადმინისტრატორი", "ავტორი", "ალერგოლოგი", "არქივარიუსი", 
  "არტილერისტი", "ავიაკონსტრუქტორი", "ავტოდილერი", "აკუსტიკოსი", "ასტროლოგი",
  // B
  "ბაზალტმჭრელი", "ბალერინა", "ბანკირი", "ბარისტა", "ბარმენი", "ბეტონშემრევი", 
  "ბიბლიოთეკარი", "ბიზნესმენი", "ბიოლოგი", "ბიოქიმიკოსი", "ბლოგერი", "ბორტგამცილებელი", 
  "ბოტანიკოსი", "ბოქსიორი", "ბრიგადირი", "ბროკერი", "ბურღავი", "ბუღალტერი", 
  "ბიოფიზიკოსი", "ბალეტმეისტერი", "ბორტინჟინერი", "ბიოინჟინერი", "ბიოეთიკოსი",
  // G
  "გამომძიებელი", "გამყიდველი", "გენერალი", "გენეტიკოსი", "გეოდეზისტი", "გეოგრაფი", 
  "გეოლოგი", "გეოფიზიკოსი", "გიდი", "გინეკოლოგი", "გიტარისტი", "გლაციოლოგი", 
  "გრავიორი", "გრაფიკოსი", "გრაფიკული დიზაინერი", "გრიმიორი", "გუბერნატორი", "გემის კაპიტანი", 
  "გაზმომმარაგებელი", "გასტროენტეროლოგი", "გემის მექანიკოსი", "გამოფენის კურატორი",
  // D
  "დამკვირვებელი", "დარაჯი", "დეკანი", "დეკორატორი", "დერმატოლოგი", "დესპანი", 
  "დეტექტივი", "დიეტოლოგი", "დიზაინერი", "დიპლომატი", "დირექტორი", "დირიჟორი", 
  "დიქტორი", "დოცენტი", "დოქტორი", "დრამატურგი", "დრამერი", "დურგალი", 
  "დენდროლოგი", "დეზინფექტორი", "დეკონსტრუქტორი", "დეპუტატი",
  // E
  "ეთნოგრაფი", "ეკოლოგი", "ეკონომისტი", "ექსკავატორშიკი", "ექსპერტი", "ელექტრიკოსი", 
  "ელექტრომონტიორი", "ემბრიოლოგი", "ენათმეცნიერი", "ენდოკრინოლოგი", "ენერგეტიკოსი", 
  "ეპიდემიოლოგი", "ეპისკოპოსი", "ეტიმოლოგი", "ექთანი", "ექიმი", "ექსკურსიამძღოლი", 
  "ეგზორცისტი", "ენზიმოლოგი", "ეთოლოგი", "ელჩი",
  // V
  "ვარჯიშის ინსტრუქტორი", "ვარსკვლავთმრიცხველი", "ვებ-გამომცემელი", "ვებ-დეველოპერი", 
  "ვებ-დიზაინერი", "ვენახის მხვნელი", "ვეტერინარი", "ვიდეოგრაფი", "ვიდეომონტაჟორი", 
  "ვიზაჟისტი", "ვიოლინისტი", "ვიცე-მერი", "ვიცე-პრეზიდენტი", "ვოკალისტი", "ვულკანოლოგი", 
  "ვაჭარი", "ველომექანიკოსი", "ვენდისტი", "ვექილი",
  // Z
  "ზარების ჩამომსხმელი", "ზედამხედველი", "ზეინკალი", "ზეთისმხდელი", "ზოგადსაგანმანათლებლო მასწავლებელი", 
  "ზოოლოგი", "ზოოტექნიკოსი", "ზოოფსიქოლოგი", "ზღვაოსანი", "ზონდერმეიკერი", "ზღვის მყვინთავი",
  // T
  "თავდაცვის სამხედრო", "თარჯიმანი", "თეატრმცოდნე", "თეოლოგი", "თერაპევტი", "თევზმჭერი", 
  "თიხის ოსტატი", "თმის სტილისტი", "თოვლის მწმენდავი", "თოჯინების ოსტატი", "თხილამურების ინსტრუქტორი", 
  "თბოენერგეტიკოსი", "თერმოდინამიკოსი", "თეორიტიკოსი", "თვალის ექიმი",
  // I
  "ილუზიონისტი", "ილუსტრატორი", "იმუნოლოგი", "ინჟინერი", "ინსპექტორი", "ინსტრუქტორი", 
  "ინფორმატიკოსი", "იპოთეკარი", "იპოდრომის მხედარი", "ისტორიკოსი", "იუველირი", "იურისტი", 
  "იხტიოლოგი", "ინტერიერის დიზაინერი", "ინოვატორი", "ინფექციონისტი",
  // K
  "კაპიტანი", "კარდიოლოგი", "კერამიკოსი", "კიბერუსაფრთხოების სპეციალისტი", "კინოკრიტიკოსი", 
  "კინომსახიობი", "კინოოპერატორი", "კინორეჟისორი", "კლარნეტისტი", "კომენტატორი", "კომპოზიტორი", 
  "კონდიტერი", "კონსტრუქტორი", "კონსულტანტი", "კოპირაიტერი", "კოსმეტოლოგი", "კოსმონავტი", 
  "კრიტიკოსი", "კულინარი", "კურატორი", "კარტოგრაფი", "კასკადიორი", "კინოლოგი", "კომუნიკატორი",
  // L
  "ლაბორანტი", "ლაზერული სპეციალისტი", "ლანდშაფტის დიზაინერი", "ლექტორი", "ლინგვისტი", 
  "ლიტერატორი", "ლითოგრაფი", "ლიფტის ხელოსანი", "ლოგოპედი", "ლოჯისტიკოსი", "ლოცმანი", 
  "ლაბორატორიის ხელმძღვანელი", "ლაპიდარისტი", "ლიტერატურული რედაქტორი",
  // M
  "მარკეტოლოგი", "მასწავლებელი", "მებაღე", "მებაჟე", "მეგობარი", "მედავითნე", "მედდა", 
  "მევენახე", "მეზღვაური", "მეთევზე", "მეთუნუქე", "მეინსტრუმენტე", "მეკარე", "მეკვლე", 
  "მელოდისტი", "მემანქანე", "მენეჯერი", "მეპურე", "მერძევე", "მესაათე", "მესაფლავე", 
  "მესაქონლე", "მეტალურგი", "მეტეოროლოგი", "მეტყევე", "მეფუტკრე", "მექვევე", "მეშახტე", 
  "მეჩუქურთმე", "მეწაღე", "მეწარმე", "მეხანძრე", "მზარეული", "მიკრობიოლოგი", "მოდელი", 
  "მონტაჟორი", "მოქანდაკე", "მომღერალი", "მსახიობი", "მუსიკოსი", "მწერალი", "მხატვარი",
  // N
  "ნავიგატორი", "ნავთობმომპოვებელი", "ნანოტექნოლოგი", "ნარკოლოგი", "ნატურალისტი", "ნევროლოგი", 
  "ნევროპათოლოგი", "ნეიროქირურგი", "ნეონატოლოგი", "ნოველისტი", "ნოტარიუსი", "ნუმიზმატი", 
  "ნარკვევიტი", "ნავთობქიმიკოსი", "ნემსთერაპევტი",
  // O
  "ოკეანოლოგი", "ოკულისტი", "ონკოლოგი", "ოპერატორი", "ოპერის მომღერალი", "ოპტიკოსი", 
  "ორთოპედი", "ორნითოლოგი", "ოსტატი", "ოტორინოლარინგოლოგი", "ოფიციანტი", "ოფიცერი", "ოქრომჭედელი", 
  "ონკოლოგი-ქირურგი", "ორთოდონტი", "ოპტიკურ-მექანიკოსი",
  // P
  "პალეონტოლოგი", "პაპარაცი", "პარაზიტოლოგი", "პარიკმახერი", "პარლამენტარი", "პათოლოგანატომი", 
  "პედაგოგი", "პედიატრი", "პიანისტი", "პილოტი", "პოეტი", "პოლიტიკოსი", "პოლიციელი", 
  "პრესატაშე", "პროგრამისტი", "პროდიუსერი", "პროკურორი", "პროფესორი", "ფსიქოლოგი", "პუბლიცისტი", 
  "პლასტიკური ქირურგი", "პულმონოლოგი", "პროქტოლოგი", "პარაშუტისტი",
  // Zh
  "ჟესტების ენის თარჯიმანი", "ჟოკეი", "ჟონგლიორი", "ჟურნალისტი", "ჟიურის წევრი", "ჟანდარმი",
  // R
  "რადიოლოგი", "რადიოწამყვანი", "რეანიმატოლოგი", "რეანიმატორი", "რევანშიზმის ანალიტიკოსი", 
  "რევიზორი", "რედაქტორი", "რეჟისორი", "რენტგენოლოგი", "რეპეტიტორი", "რეპორტიორი", 
  "რესტავრატორი", "რობოტექნიკოსი", "რადიოტექნიკოსი", "რადიომექანიკოსი", "რეგატის კაპიტანი",
  // S
  "სამხედრო", "სანტექნიკოსი", "სეისმოლოგი", "სისტემური ადმინისტრატორი", "სკულპტორი", 
  "სომელიე", "სოციოლოგი", "სპორტსმენი", "სტატისტიკოსი", "სტენოგრაფისტი", "სტილისტი", 
  "სტიუარდი", "სტიუარდესა", "სტომატოლოგი", "სტუდენტი", "სურდოპედაგოგი", "სცენარისტი", 
  "სეილს-მენეჯერი", "საიუველირო ოსტატი", "საქსოფონისტი", "სოციალური მუშაკი", "სპორტული ექიმი",
  // T'
  "ტაქსისტი", "ტელეწამყვანი", "ტექნიკოსი", "ტექნოლოგი", "ტიპოგრაფი", "ტოპოგრაფი", 
  "ტოქსიკოლოგი", "ტრავმატოლოგი", "ტრაქტორისტი", "ტურიზმის მენეჯერი", "ტურისტული გიდი", 
  "ტვირთმტვირთავი", "ტექსტისტი", "ტრენერი", "ტაქსიდერმისტი", "ტრანსპორტის დისპეტჩერი",
  // U
  "უძველესი ენების სპეციალისტი", "უძრავი ქონების აგენტი", "უნივერსიტეტის რექტორი", 
  "უროლოგი", "უსაფრთხოების ოფიცერი", "უზრუნველყოფის მენეჯერი", "უშიშროების თანამშრომელი", 
  "უფროსი მეცნიერ-თანამშრომელი", "უმაღლესი სასწავლებლის პედაგოგი",
  // P'
  "ფარმაცევტი", "ფეხბურთელი", "ფერმწერი", "ფერმერი", "ფიზიოლოგი", "ფიზიკოსი", 
  "ფილოლოგი", "ფილოსოფოსი", "ფინანსისტი", "ფისტულოლოგი", "ფიტოთერაპევტი", "ფლორისტი", 
  "ფოლიკულოლოგი", "ფოტოგრაფი", "ფსიქიატრი", "ფოტომოდელი", "ფინანსური ანალიტიკოსი",
  // Q
  "ქალაქგეგმარებელი", "ქარგვის ოსტატი", "ქვისმთლელი", "ქიმიკოსი", "ქირურგი", 
  "ქოლცენტრის ოპერატორი", "ქორეოგრაფი", "ქსილოგრაფი", "ქსოვილების ტექნოლოგი", "ქუჩის მხატვარი", 
  "ქიმიკოს-ტექნოლოგი", "ქსელის ინჟინერი", "ქორეოგრაფ-პედაგოგი",
  // Gh
  "ღამის დარაჯი", "ღამის კლუბის დიჯეი", "ღია წყლების მყვინთავი", "ღობის მშენებელი", 
  "ღორის მომშენებელი", "ღვინის ტექნოლოგი", "ღვთისმეტყველი", "ღუმელის ხელოსანი", "ღონისძიების ორგანიზატორი",
  // Q'
  "ყალიბის ოსტატი", "ყავის ოსტატი", "ყაჩაღობასთან მებრძოლი", "ყვავილების დიზაინერი", 
  "ყბა-სახის ქირურგი", "ყურძნის მკრეფავი", "ყურ-ყელ-ცხვირის ექიმი", "ყარაული",
  // Sh
  "შვეიცარი", "შინაური ცხოველების მომვლელი", "შოფერი", "შრომის უსაფრთხოების ინსპექტორი", 
  "შტურმანი", "შუამავალი", "შუშის მბერავი", "შახტიორი", "შემდუღებელი", "შპალერის მესაკრავი", "შემფასებელი",
  // Ch
  "ჩაის მწარმოებელი", "ჩარხზე მომუშავე", "ჩარხმშენებელი", "ჩელოისტი", "ჩექმის ხელოსანი", 
  "ჩინოვნიკი", "ჩოგბურთელი", "ჩონგურის ოსტატი", "ჩამომსხმელი", "ჩარჩოების ოსტატი",
  // Ts
  "ცეკვის მასწავლებელი", "ცისკრის მესათურე", "ცირკის არტისტი", "ციტოლოგი", 
  "ციფრული მარკეტოლოგი", "ცხვრის მწყემსი", "ციფრული მხატვარი", "ცენტრიფუგის ოპერატორი",
  // Dz
  "ძაღლების მწვრთნელი", "ძველი ნივთების შემფასებელი", "ძეგლთა დამცველი", "ძებნის სპეციალისტი", 
  "ძვირფასი ლითონების დამმუშავებელი", "ძიძა", "ძრავის შემკეთებელი", "ძველებური წიგნების რესტავრატორი",
  // Ts'
  "წამყვანი", "წერილების დამტარებელი", "წიგნების გამომცემელი", "წიგნებით მოვაჭრე", 
  "წისქვილის მეპატრონე", "წისქვილმშენებელი", "წყალქვეშა შედუღების სპეციალისტი", "წყლის ინჟინერი", 
  "წარმოების ხელმძღვანელი", "წარმომადგენელი",
  // Ch'
  "ჭაბურღილის ოპერატორი", "ჭადრაკის მწვრთნელი", "ჭაობის მელიორატორი", "ჭედვის ოსტატი", 
  "ჭერის მემონტაჟე", "ჭრა-კერვის სპეციალისტი", "ჭურჭლის მრეცხავი", "ჭიშკრის ოსტატი", "ჭედური ხელოვნების ოსტატი",
  // Kh
  "ხაზინადარი", "ხალხური რეწვის ოსტატი", "ხარისხის კონტროლიორი", "ხე-ტყის დამამუშავებელი", 
  "ხეხილის მომვლელი", "ხმის ოპერატორი", "ხორცის გამყიდველი", "ხურო", "ხუროთმოძღვარი", 
  "ხატმწერი", "ხელის ხელოსანი",
  // J
  "ჯაზ-მუსიკოსი", "ჯაჭვური ხერხის ოპერატორი", "ჯარისკაცი", "ჯაშუში", "ჯიხურის გამყიდველი", 
  "ჯირითის ოსტატი", "ჯოკეი სპორტსმენი", "ჯანმრთელობის ექსპერტი",
  // H
  "ჰაერნაოსანი", "ჰაკერი", "ჰემატოლოგი", "ჰიგიენისტი", "ჰიდრავლიკოსი", "ჰიდროლოგი", 
  "ჰიდრომეტეოროლოგი", "ჰისტოლოგი", "ჰომეოპათი", "ჰოსპიტლის დირექტორი", "ჰუმანიტარი", "ჰიდროინჟინერი"
];

const extraAdjectives = [
  // Colors and shades
  "თეთრი", "შავი", "წითელი", "ყვითელი", "მწვანე", "ლურჯი", "ცისფერი", "იისფერი", 
  "ნარინჯისფერი", "ვარდისფერი", "ყავისფერი", "ნაცრისფერი", "ოქროსფერი", "ვერცხლისფერი", 
  "ბორდოსფერი", "შინდისფერი", "ლიმონისფერი", "ჟოლოსფერი", "ხორცისფერი", "ზურმუხტისფერი", 
  "ფირუზისფერი", "ალუბლისფერი", "ჟანგისფერი", "ხაკისფერი", "შოკოლადისფერი", "რძისფერი", 
  "ქარვისფერი", "სპილენძისფერი", "ფერადი", "უფერო", "მუქი", "ღია", "ბაცი", "მკვეთრი",
  // Character and traits
  // A
  "ალალი", "ამაყი", "აქტიური", "არაჩვეულებრივი", "ამაღლებული", "ალერსიანი", "ანგარებიანი", 
  "არისტოკრატული", "ალტრუისტი", "ავტორიტეტული", "აუჩქარებელი", "აგრესიული", "აზრიანი", 
  "ამტანი", "ანთებული", "აპათიური", "არათანაბარი", "ასაკოვანი", "ახალგაზრდა", "ახალი",
  // B
  "ბრძენი", "ბოროტი", "ბრაზიანი", "ბეჯითი", "ბრიყვი", "ბუნებრივი", "ბრწყინვალე", 
  "ბედნიერი", "ბავშვური", "ბრტყელი", "ბასრი", "ბლაგვი", "ბნელი", "ბეჭედდასმული", "ბაჯბაჯა",
  // G
  "გონიერი", "გულუხვი", "გულკეთილი", "გულღია", "გამჭრიახი", "გულწრფელი", "გაბედული", 
  "გმირული", "გამძლე", "გემოვნებიანი", "გულმოდგინე", "გამორჩეული", "განათლებული", 
  "განსწავლული", "გენიალური", "გულქვა", "გულუბრყვილო", "გამოცდილი", "გამხდარი", "გრძელი", "გლუვი",
  // D
  "დინჯი", "დიდსულოვანი", "დახვეწილი", "დარდიანი", "დაუდევარი", "დრეკადი", "დაბალი", 
  "დიდი", "დაუზარელი", "დაუღალავი", "დამოუკიდებელი", "დამაჯერებელი", "დამთმობი", "დელიკატური",
  // E
  "ერთგული", "ენერგიული", "ელეგანტური", "ერუდირებული", "ეშმაკი", "ენამჭევრი", "ენამწარე", 
  "ერთსულოვანი", "ელასტიური", "ეგოისტი", "ექსცენტრიული", "ეფექტური", "ექსპრესიული",
  // V
  "ვერაგი", "ვაჟკაცური", "ვიწრო", "ვრცელი", "ვარდისებრი", "ვერცხლისებრი", "ვულკანური", "ვეებერთელა",
  // Z
  "ზარმაცი", "ზრდილობიანი", "ზომიერი", "ზუსტი", "ზედმიწევნითი", "ზღაპრული", "ზედაპირული", "ზეგამტარი",
  // T
  "თავმდაბალი", "თავაზიანი", "თავდადებული", "თამამი", "თვალტანადი", "ტანადი", "თბილი", 
  "თავშეკავებული", "თავდაჯერებული", "თვალთმაქცი", "თხელი", "თეთრწვერა", "თანამედროვე", "თანამგრძნობი",
  // I
  "იშვიათი", "ინტელექტუალური", "იდუმალი", "იმედიანი", "ინიციატივიანი", "ინოვაციური", 
  "ირონიული", "იდეალური", "ინტენსიური", "ინდივიდუალური", "იოლი",
  // K
  "კეთილი", "კეთილშობილი", "კდემამოსილი", "კოხტა", "კომუნიკაბელური", "კრიტიკული", 
  "კრეატიული", "კმაყოფილი", "კუშტი", "კეთილგანწყობილი", "კომფორტული", "კლასიკური",
  // L
  "ლამაზი", "ლმობიერი", "ლოგიკური", "ლაღი", "ლაკონიური", "ლოიალური", "ლირიკული", "ლბილი",
  // M
  "მამაცი", "მშვიდი", "მხიარული", "მდიდარი", "მომთმენი", "მგრძნობიარე", "მეგობრული", 
  "მოხერხებული", "მარდი", "მკვირცხლი", "მრისხანე", "მშვიდობისმოყვარე", "მწყალობელი", 
  "მორცხვი", "მჭევრმეტყველი", "მდუმარე", "მორიდებული", "მზაკვარი", "მუხანათი", "მხნე", 
  "მაღალი", "მსუქანი", "მოხუცი", "მაგარი", "მყარი", "მსხვრევადი", "მყიფე", "მრგვალი", "მძიმე", "მსუბუქი",
  // N
  "ნელი", "ნიჭიერი", "ნაზი", "ნაღვლიანი", "ნამდვილი", "ნათელი", "ნაყოფიერი", "ნაზუქიანი", 
  "ნეიტრალური", "ნარნარი", "ნატიფი", "ნავარჯიშევი", "ნოტიო",
  // O
  "ოპტიმისტი", "ორიგინალური", "ობიექტური", "ორგული", "ორგანიზებული", "ოხერი", "ოპერატიული", "ოთხკუთხა",
  // P
  "პატიოსანი", "პასუხისმგებლიანი", "პირდაპირი", "პასიური", "პესიმისტი", "პირქუში", 
  "პრინციპული", "პუნქტუალური", "პრაქტიკული", "პოზიტიური", "პატარა", "პოეტური",
  // Zh
  "ჟინიანი", "ჟრუანტელიანი", "ჟრიამულიანი", "ჟანგიანი", "ჟურნალისტური", "ჟილკიანი",
  // R
  "რაინდული", "რბილი", "რაციონალური", "რადიკალური", "რომანტიკული", "რეალისტი", "რბილგულიანი", "რთული",
  // S
  "სულელი", "სუსტი", "სწრაფი", "სევდიანი", "სამართლიანი", "საიმედო", "სათნო", "სანდო", 
  "საოცარი", "საკვირველი", "საუკეთესო", "საშინელი", "საზარელი", "საყვარელი", "სათუთი", 
  "სუფთა", "სველი", "სწორი", "სიმპათიური", "სოლიდური", "სკეპტიკური",
  // T'
  "ტკბილი", "ტკბილმოუბარი", "ტლანქი", "ტრადიციული", "ტოლერანტული", "ტემპერამენტიანი", "ტალღოვანი",
  // U
  "უნიჭო", "უჭკუო", "უსამართლო", "უპატიოსნო", "უიმედო", "უყურადღებო", "უგრძნობი", "უშიშარი", 
  "უანგარო", "უსირცხვილო", "უტიფარი", "უზრდელი", "უღალატო", "უგემოვნო", "უშნო", "უძლური", 
  "უდარდელი", "უპასუხისმგებლო", "უგუნური", "უმეცარი", "უწიგნური", "უნიკალური", "უებრო", 
  "უბადლო", "უარესი", "უხეში", "უფროსი", "უმცროსი", "უკეთესი", "უბრალო",
  // P'
  "ფხიზელი", "ფიცხი", "ფაქიზი", "ფრთხილი", "ფართო", "ფასდაუდებელი", "ფილოსოფიური", "ფანტასტიკური",
  // Q
  "ქედმაღალი", "ქარაფშუტა", "ქალური", "ქართული", "ქერა", "ქედუხრელი", "ქარიშხლიანი", "ქოთქოთა",
  // Gh
  "ღარიბი", "ღირსეული", "ღონიერი", "ღრმა", "ღიმილიანი", "ღვთისნიერი", "ღირებული", "ღია-მწვანე", "ღია-ლურჯი",
  // Q'
  "ყურადღებიანი", "ყბედი", "ყოჩაღი", "ყინულოვანი", "ყვითელთმიანი", "ყავისფერთმიანი", "ყრუ",
  // Sh
  "შრომისმოყვარე", "შორსმჭვრეტელი", "შინაური", "შემოქმედებითი", "შესანიშნავი", "შესაფერისი", "შმაგი",
  // Ch
  "ჩაკეტილი", "ჩასკვნილი", "ჩვეულებრივი", "ჩუმი", "ჩვილი", "ჩქარი", "ჩახლართული",
  // Ts
  "ცბიერი", "ცქვიტი", "ცოცხალი", "ცივი", "ცხელი", "ცვალებადი", "ცნობისმოყვარე",
  // Dz
  "ძუნწი", "ძლიერი", "ძვირფასი", "ძველი", "ძირფესვიანი", "ძალუმად", "ძნელი",
  // Ts'
  "წრფელი", "წვრილმანი", "წარმოსადეგი", "წიგნიერი", "წარმატებული", "წითელთმიანი", "წვრილი", "წვეტიანი",
  // Ch'
  "ჭკვიანი", "ჭრელი", "ჭარმაგი", "ჭაბუკური", "ჭეშმარიტი", "ჭყლიაპა", "ჭუჭყიანი",
  // Kh
  "ხალისიანი", "ხასიათიანი", "ხარბი", "ხორკლიანი", "ხნიერი", "ხარისხიანი", "ხმელი", "ხმაურიანი",
  // J
  "ჯანიანი", "ჯანმრთელი", "ჯიუტი", "ჯადოსნური", "ჯენტლმენური", "ჯიშიანი",
  // H
  "ჰარმონიული", "ჰუმანური", "ჰუმანისტური", "ჰეროიკული", "ჰაეროვანი", "ჰიგიენური"
];

console.log('Updating Professions...');
updateBuilder('professions.js', extraProfessions.map(w => ({ w, popularity: 4 })));

console.log('Updating Adjectives...');
updateBuilder('adjectives.js', extraAdjectives.map(w => ({ w, popularity: 4 })));
